app/Controllers/PegawaiController.php

    public function index()
    {
        $employeeModel = new PegawaiModel();
        $data['pegawai'] = $employeeModel->findAll();
---
SELECT *
FROM `pegawai`

    public function edit($id)
    {
        $employeeModel = new PegawaiModel();
        $data['employee'] = $employeeModel->find($id);
---
SELECT *
FROM `pegawai`
WHERE `pegawai`.`id` = '2'