app/Controllers/UsersController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function edit($id)
    {
        $userModel = new UserModel();
        $data['user'] = $userModel->find($id);